//===========================================================================================
//
// [scene.cpp]
// Author : Takeru Ogasawara
//
//===========================================================================================
#include "scene.h"
#include "manager.h"
#include "renderer.h"
#include "camera.h"

#include "title.h"
#include "game.h"
#include "result.h"
#include "ranking.h"

//===========================================================================================
// コンストラクタ
//===========================================================================================
CScene::CScene()
{
	m_mode = MODE_GAME;
}

//===========================================================================================
// デストラクタ
//===========================================================================================
CScene::~CScene()
{

}

//===========================================================================================
// シーンの生成
//===========================================================================================
CScene* CScene::Create(MODE mode)
{
	CScene* pScene = nullptr;

	if (pScene == nullptr)
	{
		//モード別の生成
		switch (mode)
		{
		case MODE_TITLE:
			pScene = new CTitle;
			break;

		case MODE_GAME:
			pScene = new CGame;
			break;

		case MODE_RESULT:
			pScene = new CResult;
			break;

		case MODE_RANKING:
			pScene = new CRanking;
			break;
		}
	}

	return pScene;
}

//===========================================================================================
// 初期化処理
//===========================================================================================
HRESULT CScene::Init(void)
{
	return S_OK;
}

//===========================================================================================
// 終了処理
//===========================================================================================
void CScene::Uninit(void)
{

}

//===========================================================================================
// 更新処理
//===========================================================================================
void CScene::Update(void)
{
	//カメラの更新処理
	if (CManager::GetInstance()->GetCamera() != nullptr)
	{
		CManager::GetInstance()->GetCamera()->Update();
	}

	//レンダラーの更新処理
	if (CManager::GetInstance()->GetRenderer() != nullptr)
	{
		CManager::GetInstance()->GetRenderer()->Update();
	}
}

//===========================================================================================
// 描画処理
//===========================================================================================
void CScene::Draw(void)
{
	if (CManager::GetInstance()->GetRenderer() != nullptr)
	{
		CManager::GetInstance()->GetRenderer()->Draw();
	}
}